
{
 "description":"Add an audio resource.",
 "parameters":
 [
   {"name":"username", "required":false, "bindTime":true, "description":"The username used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"password", "required":false, "bindTime":true, "description":"The password used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"iam_access_token", "required":false, "bindTime":true, "description":"An IAM access token fully managed by the application. Responsibility falls on the application to refresh the token, either before it expires or reactively upon receiving a 401 from the service, as any requests made with an expired token will fail."},
   {"name":"iam_apikey", "required":false, "bindTime":true, "description":"An API key that can be used to request IAM tokens. If this API key is provided, the SDK will manage the token and handle the refreshing."},
   {"name":"iam_url", "required":false, "bindTime":true, "description":"An optional URL for the IAM service API. Defaults to 'https://iam.ng.bluemix.net/identity/token"},
   {"name":"headers", "required":false, "bindTime":true, "description":"The request headers"},
   {"name":"headers[X-Watson-Learning-Opt-Out]", "required":false, "bindTime":true, "description":"opt-out of data collection"},
   {"name":"url", "required":false, "bindTime":true, "description":"override default service base url"},
   {"name":"customization_id", "required":true, "bindTime":false, "description":"The customization ID (GUID) of the custom acoustic model. You must make the request with service credentials created for the instance of the service that owns the custom model."},
   {"name":"audio_name", "required":true, "bindTime":false, "description":"The name of the audio resource for the custom acoustic model. When adding an audio resource, do not include spaces in the name; use a localized name that matches the language of the custom model."},
   {"name":"audio_resource", "required":true, "bindTime":false, "description":"The audio resource that is to be added to the custom acoustic model, an individual audio file or an archive file."},
   {"name":"content_type", "required":true, "bindTime":false, "description":"The type of the input: application/zip, application/gzip, audio/basic, audio/flac, audio/l16, audio/mp3, audio/mpeg, audio/mulaw, audio/ogg, audio/ogg;codecs=opus, audio/ogg;codecs=vorbis, audio/wav, audio/webm, audio/webm;codecs=opus, or audio/webm;codecs=vorbis."},
   {"name":"contained_content_type", "required":false, "bindTime":false, "description":"For an archive-type resource, specifies the format of the audio files contained in the archive file. The parameter accepts all of the audio formats supported for use with speech recognition, including the `rate`, `channels`, and `endianness` parameters that are used with some formats. For a complete list of supported audio formats, see [Audio formats](/docs/services/speech-to-text/input.html#formats)."},
   {"name":"allow_overwrite", "required":false, "bindTime":false, "description":"If `true`, the specified corpus or audio resource overwrites an existing corpus or audio resource with the same name. If `false` (the default), the request fails if a corpus or audio resource with the same name already exists. The parameter has no effect if a corpus or audio resource with the same name does not already exist."}
 ],
 "sampleInput": "Coming soon!",
 "sampleOutput": "Coming soon!"
}
