
{
 "description":"Add a custom word.",
 "parameters":
 [
   {"name":"username", "required":false, "bindTime":true, "description":"The username used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"password", "required":false, "bindTime":true, "description":"The password used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"iam_access_token", "required":false, "bindTime":true, "description":"An IAM access token fully managed by the application. Responsibility falls on the application to refresh the token, either before it expires or reactively upon receiving a 401 from the service, as any requests made with an expired token will fail."},
   {"name":"iam_apikey", "required":false, "bindTime":true, "description":"An API key that can be used to request IAM tokens. If this API key is provided, the SDK will manage the token and handle the refreshing."},
   {"name":"iam_url", "required":false, "bindTime":true, "description":"An optional URL for the IAM service API. Defaults to 'https://iam.ng.bluemix.net/identity/token"},
   {"name":"headers", "required":false, "bindTime":true, "description":"The request headers"},
   {"name":"headers[X-Watson-Learning-Opt-Out]", "required":false, "bindTime":true, "description":"opt-out of data collection"},
   {"name":"url", "required":false, "bindTime":true, "description":"override default service base url"},
   {"name":"customization_id", "required":true, "bindTime":false, "description":"The customization ID (GUID) of the custom language model. You must make the request with service credentials created for the instance of the service that owns the custom model."},
   {"name":"word_name", "required":true, "bindTime":false, "description":"The custom word for the custom language model. When you add or update a custom word with the **Add a custom word** method, do not include spaces in the word. Use a `-` (dash) or `_` (underscore) to connect the tokens of compound words."},
   {"name":"word", "required":false, "bindTime":false, "description":"For the **Add custom words** method, you must specify the custom word that is to be added to or updated in the custom model. Do not include spaces in the word. Use a `-` (dash) or `_` (underscore) to connect the tokens of compound words.   Omit this field for the **Add a custom word** method."},
   {"name":"sounds_like", "required":false, "bindTime":false, "description":"An array of sounds-like pronunciations for the custom word. Specify how words that are difficult to pronounce, foreign words, acronyms, and so on can be pronounced by users. For a word that is not in the service's base vocabulary, omit the parameter to have the service automatically generate a sounds-like pronunciation for the word. For a word that is in the service's base vocabulary, use the parameter to specify additional pronunciations for the word. You cannot override the default pronunciation of a word; pronunciations you add augment the pronunciation from the base vocabulary. A word can have at most five sounds-like pronunciations, and a pronunciation can include at most 40 characters not including spaces."},
   {"name":"display_as", "required":false, "bindTime":false, "description":"An alternative spelling for the custom word when it appears in a transcript. Use the parameter when you want the word to have a spelling that is different from its usual representation or from its spelling in corpora training data."}
 ],
 "sampleInput": "Coming soon!",
 "sampleOutput": "Coming soon!"
}
