
{
 "description":"Train a custom language model.",
 "parameters":
 [
   {"name":"username", "required":false, "bindTime":true, "description":"The username used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"password", "required":false, "bindTime":true, "description":"The password used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"iam_access_token", "required":false, "bindTime":true, "description":"An IAM access token fully managed by the application. Responsibility falls on the application to refresh the token, either before it expires or reactively upon receiving a 401 from the service, as any requests made with an expired token will fail."},
   {"name":"iam_apikey", "required":false, "bindTime":true, "description":"An API key that can be used to request IAM tokens. If this API key is provided, the SDK will manage the token and handle the refreshing."},
   {"name":"iam_url", "required":false, "bindTime":true, "description":"An optional URL for the IAM service API. Defaults to 'https://iam.ng.bluemix.net/identity/token"},
   {"name":"headers", "required":false, "bindTime":true, "description":"The request headers"},
   {"name":"headers[X-Watson-Learning-Opt-Out]", "required":false, "bindTime":true, "description":"opt-out of data collection"},
   {"name":"url", "required":false, "bindTime":true, "description":"override default service base url"},
   {"name":"customization_id", "required":true, "bindTime":false, "description":"The customization ID (GUID) of the custom language model. You must make the request with service credentials created for the instance of the service that owns the custom model."},
   {"name":"word_type_to_add", "required":false, "bindTime":false, "description":"The type of words from the custom language model's words resource on which to train the model: * `all` (the default) trains the model on all new words, regardless of whether they were extracted from corpora or were added or modified by the user. * `user` trains the model only on new words that were added or modified by the user; the model is not trained on new words extracted from corpora."},
   {"name":"customization_weight", "required":false, "bindTime":false, "description":"Specifies a customization weight for the custom language model. The customization weight tells the service how much weight to give to words from the custom language model compared to those from the base model for speech recognition. Specify a value between 0.0 and 1.0; the default is 0.3.   The default value yields the best performance in general. Assign a higher value if your audio makes frequent use of OOV words from the custom model. Use caution when setting the weight: a higher value can improve the accuracy of phrases from the custom model's domain, but it can negatively affect performance on non-domain phrases.   The value that you assign is used for all recognition requests that use the model. You can override it for any recognition request by specifying a customization weight for that request."}
 ],
 "sampleInput": "Coming soon!",
 "sampleOutput": "Coming soon!"
}
