
{
 "description":"Update workspace.",
 "parameters":
 [
   {"name":"username", "required":false, "bindTime":true, "description":"The username used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"password", "required":false, "bindTime":true, "description":"The password used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"iam_access_token", "required":false, "bindTime":true, "description":"An IAM access token fully managed by the application. Responsibility falls on the application to refresh the token, either before it expires or reactively upon receiving a 401 from the service, as any requests made with an expired token will fail."},
   {"name":"iam_apikey", "required":false, "bindTime":true, "description":"An API key that can be used to request IAM tokens. If this API key is provided, the SDK will manage the token and handle the refreshing."},
   {"name":"iam_url", "required":false, "bindTime":true, "description":"An optional URL for the IAM service API. Defaults to 'https://iam.ng.bluemix.net/identity/token"},
   {"name":"headers", "required":false, "bindTime":true, "description":"The request headers"},
   {"name":"headers[X-Watson-Learning-Opt-Out]", "required":false, "bindTime":true, "description":"opt-out of data collection"},
   {"name":"url", "required":false, "bindTime":true, "description":"override default service base url"},
   {"name":"version", "required":true, "bindTime":true, "description":"Release date of the API version in YYYY-MM-DD format."},
   {"name":"workspace_id", "required":true, "bindTime":false, "description":"Unique identifier of the workspace."},
   {"name":"name", "required":false, "bindTime":false, "description":"The name of the workspace. This string cannot contain carriage return, newline, or tab characters, and it must be no longer than 64 characters."},
   {"name":"description", "required":false, "bindTime":false, "description":"The description of the workspace. This string cannot contain carriage return, newline, or tab characters, and it must be no longer than 128 characters."},
   {"name":"language", "required":false, "bindTime":false, "description":"The language of the workspace."},
   {"name":"intents", "required":false, "bindTime":false, "description":"An array of objects defining the intents for the workspace."},
   {"name":"entities", "required":false, "bindTime":false, "description":"An array of objects defining the entities for the workspace."},
   {"name":"dialog_nodes", "required":false, "bindTime":false, "description":"An array of objects defining the nodes in the workspace dialog."},
   {"name":"counterexamples", "required":false, "bindTime":false, "description":"An array of objects defining input examples that have been marked as irrelevant input."},
   {"name":"metadata", "required":false, "bindTime":false, "description":"Any metadata related to the workspace."},
   {"name":"learning_opt_out", "required":false, "bindTime":false, "description":"Whether training data from the workspace can be used by IBM for general service improvements. `true` indicates that workspace training data is not to be used."}
   {"name":"append", "required":false, "bindTime":false, "description":"Whether the new data is to be appended to the existing data in the workspace. If **append**=`false`, elements included in the new data completely replace the corresponding existing elements, including all subelements. For example, if the new data includes **entities** and **append**=`false`, all existing entities in the workspace are discarded and replaced with the new entities.    If **append**=`true`, existing elements are preserved, and the new elements are added. If any elements in the new data collide with existing elements, the update request fails."}
 ],
 "sampleInput": "Coming soon!",
 "sampleOutput": "Coming soon!"
}
