
{
 "description":"Create or update expansion list.",
 "parameters":
 [
   {"name":"username", "required":false, "bindTime":true, "description":"The username used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"password", "required":false, "bindTime":true, "description":"The password used to authenticate with the service. Username and password credentials are only required to run your application locally or outside of IBM Cloud. When running on IBM Cloud, the credentials will be automatically loaded from the `VCAP_SERVICES` environment variable."},
   {"name":"iam_access_token", "required":false, "bindTime":true, "description":"An IAM access token fully managed by the application. Responsibility falls on the application to refresh the token, either before it expires or reactively upon receiving a 401 from the service, as any requests made with an expired token will fail."},
   {"name":"iam_apikey", "required":false, "bindTime":true, "description":"An API key that can be used to request IAM tokens. If this API key is provided, the SDK will manage the token and handle the refreshing."},
   {"name":"iam_url", "required":false, "bindTime":true, "description":"An optional URL for the IAM service API. Defaults to 'https://iam.ng.bluemix.net/identity/token"},
   {"name":"headers", "required":false, "bindTime":true, "description":"The request headers"},
   {"name":"headers[X-Watson-Learning-Opt-Out]", "required":false, "bindTime":true, "description":"opt-out of data collection"},
   {"name":"url", "required":false, "bindTime":true, "description":"override default service base url"},
   {"name":"version", "required":true, "bindTime":true, "description":"Release date of the API version in YYYY-MM-DD format."},
   {"name":"environment_id", "required":true, "bindTime":false, "description":"The ID of the environment."},
   {"name":"collection_id", "required":true, "bindTime":false, "description":"The ID of the collection."},
   {"name":"expansions", "required":true, "bindTime":false, "description":"An array of query expansion definitions.    Each object in the `expansions` array represents a term or set of terms that will be expanded into other terms. Each expansion object can be configured so that all terms are expanded to all other terms in the object - bi-directional, or a set list of terms can be expanded into a second list of terms - uni-directional.   To create a bi-directional expansion specify an `expanded_terms` array. When found in a query, all items in the `expanded_terms` array are then expanded to the other items in the same array.   To create a uni-directional expansion, specify both an array of `input_terms` and an array of `expanded_terms`. When items in the `input_terms` array are present in a query, they are expanded using the items listed in the `expanded_terms` array."}
 ],
 "sampleInput": "Coming soon!",
 "sampleOutput": "Coming soon!"
}
